Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: وإنك لعلى خلق عظيم
en: And thou (standest) on an exalted standard of character.

source: فستبصر ويبصرون
en: Soon wilt thou see, and they will see,

source: بأييكم المفتون
en: Which of you is afflicted with madness.

source: إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بالمهتدين
en: Verily it is thy Lord that knoweth best, which (among men) hath strayed from His Path: and He knoweth best those who receive (true) Guidance.

source: فلا تطع المكذبين
en: So hearken not to those who deny (the Truth).

source: ودوا لو تدهن فيدهنون
en: Their desire is that thou shouldst be pliant: so would they be pliant.

source: ولا تطع كل حلاف مهين
en: Heed not the type of despicable men,- ready with oaths,

source: هماز مشاء بنميم
en: A slanderer, going about with calumnies,

source: مناع للخير معتد أثيم
en: (Habitually) hindering (all) good, transgressing beyond bounds, deep in sin,

source: عتل بعد ذلك زنيم
en: Violent (and cruel),- with all that, base-born,-

source: أن كان ذا مال وبنين
en: Because he possesses wealth and (numerous) sons.

source: إذا تتلى عليه آياتنا قال أساطير الأولين
en: When to him are rehearsed Our Signs, "Tales of the ancients", he cries!

source: سنسمه على الخرطوم
en: Soon shall We brand (the beast) on the snout!

source: إنا بلوناهم كما بلونا أصحاب الجنة إذ أقسموا ليصرمنها مصبحين
en: Verily We have tried them as We tried the People of the Garden, when they resolved to gather the fruits of the (garden) in the morning.

source: ولا يستثنون
en: But made no reservation, ("If it be Allah's Will").

source: فطاف عليها طائف من ربك وهم نائمون
en: Then there came on the (garden) a visitation from thy Lord, (which swept away) all around, while they were asleep.

source: فأصبحت كالصريم
en: So the (garden) became, by the morning, like a dark and desolate spot, (whose fruit had been gathered).

source: فتنادوا مصبحين
en: As the morning broke, they called out, one to another,-

source: أن اغدوا على حرثكم إن كنتم صارمين
en: "Go ye to your tilth (betimes) in the morning, if ye would gather the fruits."

source: فانطلقوا وهم يتخافتون
en: So they departed, conversing in secret low tones, (saying)-

source: أن لا يدخلنها اليوم عليكم مسكين
en: "Let not a single indigent person break in upon you into the (garden) this day."

source: وغدوا على حرد قادرين
en: And they opened the morning, strong in an (unjust) resolve.

source: فلما رأوها قالوا إنا لضالون
en: But when they saw the (garden), they said: "We have surely lost our way:

source: قال أوسطهم ألم أقل لكم لولا تسبحون
en: Said one of them, more just (than the rest): "Did I not say to you, 'Why not glorify (Allah)?'"

source: قالوا سبحان ربنا إنا كنا ظالمين
en: They said: "Glory to our Lord! Verily we have been doing wrong!"

source: فأقبل بعضهم على بعض يتلاومون
en: Then they turned, one against another, in reproach.

source: قالوا يا ويلنا إنا كنا طاغين
en: They said: "Alas for us! We have indeed transgressed!

source: عسى ربنا أن يبدلنا خيرا منها إنا إلى ربنا راغبون
en: "It may be that our Lord will give us in exchange a better (garden) than this: for we do turn to Him (in repentance)!"

source: كذلك العذاب ولعذاب الآخرة أكبر لو كانوا يعلمون
en: Such is the Punishment (in this life); but greater is the Punishment in the Hereafter,- if only they knew!

source: إن للمتقين عند ربهم جنات النعيم
en: Verily, for the Righteous, are Gardens of Delight, in the Presence of their Lord.

source: أفنجعل المسلمين كالمجرمين
en: Shall We then treat the People of Faith like the People of Sin?

source: أم لكم كتاب فيه تدرسون
en: Or have ye a book through which ye learn-

source: إن لكم فيه لما تخيرون
en: That ye shall have, through it whatever ye choose?

source: أم لكم أيمان علينا بالغة إلى يوم القيامة إن لكم لما تحكمون
en: Or have ye Covenants with Us to oath, reaching to the Day of Judgment, (providing) that ye shall have whatever ye shall demand?

source: سلهم أيهم بذلك زعيم
en: Ask thou of them, which of them will stand surety for that!

source: أم لهم شركاء فليأتوا بشركائهم إن كانوا صادقين
en: Or have they some "Partners" (in Allahhead)? Then let them produce their "partners", if they are truthful!

source: يوم يكشف عن ساق ويدعون إلى السجود فلا يستطيعون
en: The Day that the shin shall be laid bare, and they shall be summoned to bow in adoration, but they shall not be able,-

source: خاشعة أبصارهم ترهقهم ذلة وقد كانوا يدعون إلى السجود وهم سالمون
en: Their eyes will be cast down,- ignominy will cover them; seeing that they had been summoned aforetime to bow in adoration, while they were whole, (and had refused).

source: فذرني ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون
en: Then leave Me alone with such as reject this Message: by degrees shall We punish them from directions they perceive not.

source: فاصبر لحكم ربك ولا تكن كصاحب الحوت إذ نادى وهو مكظوم
en: So wait with patience for the Command of thy Lord, and be not like the Companion of the Fish,- when he cried out in agony.

source: لولا أن تداركه نعمة من ربه لنبذ بالعراء وهو مذموم
en: Had not Grace from his Lord reached him, he would indeed have been cast off on the naked shore, in disgrace.

source: فاجتباه ربه فجعله من الصالحين
en: Thus did his Lord choose him and make him of the Company of the Righteous.

source: وإن يكاد الذين كفروا ليزلقونك بأبصارهم لما سمعوا الذكر ويقولون إنه لمجنون
en: And the Unbelievers would almost trip thee up with their eyes when they hear the Message; and they say: "Surely he is possessed!"

source: وما هو إلا ذكر للعالمين
en: But it is nothing less than a Message to all the worlds.

source: الحاقة
en: The Sure Reality!

source: ما الحاقة
en: What is the Sure Reality?

source: وما أدراك ما الحاقة
en: And what will make thee realise what the Sure Reality is?

source: كذبت ثمود وعاد بالقارعة
en: The Thamud and the 'Ad People (branded) as false the Stunning Calamity!

source: فأما ثمود فأهلكوا بالطاغية
en: But the Thamud,- they were destroyed by a terrible Storm of thunder and lightning!

source: وأما عاد فأهلكوا بريح صرصر عاتية
en: And the 'Ad, they were destroyed by a furious Wind, exceedingly violent;

source: سخرها عليهم سبع ليال وثمانية أيام حسوما فترى القوم فيها صرعى كأنهم أعجاز نخل خاوية
en: He made it rage against them seven nights and eight days in succession: so that thou couldst see the (whole) people lying prostrate in its (path), as they had been roots of hollow palm-trees tumbled down!

source: فهل ترى لهم من باقية
en: Then seest thou any of them left surviving?

source: وجاء فرعون ومن قبله والمؤتفكات بالخاطئة
en: And Pharaoh, and those before him, and the Cities Overthrown, committed habitual Sin.

source: فعصوا رسول ربهم فأخذهم أخذة رابية
en: And disobeyed (each) the messenger of their Lord; so He punished them with an abundant Penalty.

source: إنا لما طغى الماء حملناكم في الجارية
en: We, when the water (of Noah's Flood) overflowed beyond its limits, carried you (mankind), in the floating (Ark),

source: لنجعلها لكم تذكرة وتعيها أذن واعية
en: That We might make it a Message unto you, and that ears (that should hear the tale and) retain its memory should bear its (lessons) in remembrance.

source: فإذا نفخ في الصور نفخة واحدة
en: Then, when one blast is sounded on the Trumpet,

source: وحملت الأرض والجبال فدكتا دكة واحدة
en: And the earth is moved, and its mountains, and they are crushed to powder at one stroke,-

source: فيومئذ وقعت الواقعة
en: On that Day shall the (Great) Event come to pass.

source: وانشقت السماء فهي يومئذ واهية
en: And the sky will be rent asunder, for it will that Day be flimsy,

source: والملك على أرجائها ويحمل عرش ربك فوقهم يومئذ ثمانية
en: And the angels will be on its sides, and eight will, that Day, bear the Throne of thy Lord above them.

source: يومئذ تعرضون لا تخفى منكم خافية
en: That Day shall ye be brought to Judgment: not an act of yours that ye hide will be hidden.

source: فأما من أوتي كتابه بيمينه فيقول هاؤم اقرءوا كتابيه
en: Then he that will be given his Record in his right hand will say: "Ah here! Read ye my Record!

source: إني ظننت أني ملاق حسابيه
en: "I did really understand that my Account would (One Day) reach me!"

source: فهو في عيشة راضية
en: And he will be in a life of Bliss,

source: في جنة عالية
en: In a Garden on high,

source: قطوفها دانية
en: The Fruits whereof (will hang in bunches) low and near.

source: كلوا واشربوا هنيئا بما أسلفتم في الأيام الخالية
en: "Eat ye and drink ye, with full satisfaction; because of the (good) that ye sent before you, in the days that are gone!"

source: وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه
en: And he that will be given his Record in his left hand, will say: "Ah! Would that my Record had not been given to me!

source: ولم أدر ما حسابيه
en: "And that I had never realised how my account (stood)!

source: يا ليتها كانت القاضية
en: "Ah! Would that (Death) had made an end of me!

source: ما أغنى عني ماليه
en: "Of no profit to me has been my wealth!

source: هلك عني سلطانيه
en: "My power has perished from me!"...

source: خذوه فغلوه
en: (The stern command will say): "Seize ye him, and bind ye him,

source: ثم الجحيم صلوه
en: "And burn ye him in the Blazing Fire.

source: ثم في سلسلة ذرعها سبعون ذراعا فاسلكوه
en: "Further, make him march in a chain, whereof the length is seventy cubits!

source: إنه كان لا يؤمن بالله العظيم
en: "This was he that would not believe in Allah Most High.

source: ولا يحض على طعام المسكين
en: "And would not encourage the feeding of the indigent!

source: فليس له اليوم هاهنا حميم
en: "So no friend hath he here this Day.

source: ولا طعام إلا من غسلين
en: "Nor hath he any food except the corruption from the washing of wounds,

source: لا يأكله إلا الخاطئون
en: "Which none do eat but those in sin."

source: فلا أقسم بما تبصرون
en: So I do call to witness what ye see,

source: وما لا تبصرون
en: And what ye see not,

source: إنه لقول رسول كريم
en: That this is verily the word of an honoured messenger;

source: وما هو بقول شاعر قليلا ما تؤمنون
en: It is not the word of a poet: little it is ye believe!

source: ولا بقول كاهن قليلا ما تذكرون
en: Nor is it the word of a soothsayer: little admonition it is ye receive.

source: ولو تقول علينا بعض الأقاويل
en: And if the messenger were to invent any sayings in Our name,

source: لأخذنا منه باليمين
en: We should certainly seize him by his right hand,

source: ثم لقطعنا منه الوتين
en: And We should certainly then cut off the artery of his heart:

source: فما منكم من أحد عنه حاجزين
en: Nor could any of you withhold him (from Our wrath).

source: وإنه لتذكرة للمتقين
en: But verily this is a Message for the Allah-fearing.

source: وإنا لنعلم أن منكم مكذبين
en: And We certainly know that there are amongst you those that reject (it).

source: وإنه لحسرة على الكافرين
en: But truly (Revelation) is a cause of sorrow for the Unbelievers.

source: وإنه لحق اليقين
en: But verily it is Truth of assured certainty.

source: سأل سائل بعذاب واقع
en: A questioner asked about a Penalty to befall-

source: للكافرين ليس له دافع
en: The Unbelievers, the which there is none to ward off,-

source: من الله ذي المعارج
en: (A Penalty) from Allah, Lord of the Ways of Ascent.

source: تعرج الملائكة والروح إليه في يوم كان مقداره خمسين ألف سنة
en: The angels and the spirit ascend unto him in a Day the measure whereof is (as) fifty thousand years:

source: فاصبر صبرا جميلا
en: Therefore do thou hold Patience,- a Patience of beautiful (contentment).

source: إنهم يرونه بعيدا
en: They see the (Day) indeed as a far-off (event):

source: ونراه قريبا
en: But We see it (quite) near.

source: يوم تكون السماء كالمهل
en: The Day that the sky will be like molten brass,

source: وتكون الجبال كالعهن
en: And the mountains will be like wool,

source: ولا يسأل حميم حميما
en: And no friend will ask after a friend,

source: يبصرونهم يود المجرم لو يفتدي من عذاب يومئذ ببنيه
en: Though they will be put in sight of each other,- the sinner's desire will be: Would that he could redeem himself from the Penalty of that Day by (sacrificing) his children,

source: وصاحبته وأخيه
en: His wife and his brother,

source: وفصيلته التي تؤويه
en: His kindred who sheltered him,

source: ومن في الأرض جميعا ثم ينجيه
en: And all, all that is on earth,- so it could deliver him:

source: كلا إنها لظى
en: By no means! for it would be the Fire of Hell!-

source: نزاعة للشوى
en: Plucking out (his being) right to the skull!-

source: تدعو من أدبر وتولى
en: Inviting (all) such as turn their backs and turn away their faces (from the Right).

source: وجمع فأوعى
en: And collect (wealth) and hide it (from use)!

source: إن الإنسان خلق هلوعا
en: Truly man was created very impatient;-

source: إذا مسه الشر جزوعا
en: Fretful when evil touches him;

source: وإذا مسه الخير منوعا
en: And niggardly when good reaches him;-

source: إلا المصلين
en: Not so those devoted to Prayer;-

source: الذين هم على صلاتهم دائمون
en: Those who remain steadfast to their prayer;

source: والذين في أموالهم حق معلوم
en: And those in whose wealth is a recognised right.

source: للسائل والمحروم
en: For the (needy) who asks and him who is prevented (for some reason from asking);

source: والذين يصدقون بيوم الدين
en: And those who hold to the truth of the Day of Judgment;

source: والذين هم من عذاب ربهم مشفقون
en: And those who fear the displeasure of their Lord,-

source: إن عذاب ربهم غير مأمون
en: For their Lord's displeasure is the opposite of Peace and Tranquillity;-

source: والذين هم بشهاداتهم قائمون
en: And those who stand firm in their testimonies;

source: والذين هم على صلاتهم يحافظون
en: And those who guard (the sacredness) of their worship;-

source: أولئك في جنات مكرمون
en: Such will be the honoured ones in the Gardens (of Bliss).

source: فمال الذين كفروا قبلك مهطعين
en: Now what is the matter with the Unbelievers that they rush madly before thee-

source: عن اليمين وعن الشمال عزين
en: From the right and from the left, in crowds?

source: أيطمع كل امرئ منهم أن يدخل جنة نعيم
en: Does every man of them long to enter the Garden of Bliss?

source: كلا إنا خلقناهم مما يعلمون
en: By no means! For We have created them out of the (base matter) they know!

source: فلا أقسم برب المشارق والمغارب إنا لقادرون
en: Now I do call to witness the Lord of all points in the East and the West that We can certainly-

source: على أن نبدل خيرا منهم وما نحن بمسبوقين
en: Substitute for them better (men) than they; And We are not to be defeated (in Our Plan).

source: يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون
en: The Day whereon they will issue from their sepulchres in sudden haste as if they were rushing to a goal-post (fixed for them),-

source: خاشعة أبصارهم ترهقهم ذلة ذلك اليوم الذي كانوا يوعدون
en: Their eyes lowered in dejection,- ignominy covering them (all over)! such is the Day the which they are promised!

source: إنا أرسلنا نوحا إلى قومه أن أنذر قومك من قبل أن يأتيهم عذاب أليم
en: We sent Noah to his People (with the Command): "Do thou warn thy People before there comes to them a grievous Penalty."

source: قال يا قوم إني لكم نذير مبين
en: He said: "O my People! I am to you a Warner, clear and open:

source: أن اعبدوا الله واتقوه وأطيعون
en: "That ye should worship Allah, fear Him and obey me:

source: يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى إن أجل الله إذا جاء لا يؤخر لو كنتم تعلمون
en: "So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew."

source: قال رب إني دعوت قومي ليلا ونهارا
en: He said: "O my Lord! I have called to my People night and day:

source: فلم يزدهم دعائي إلا فرارا
en: "But my call only increases (their) flight (from the Right).

source: وإني كلما دعوتهم لتغفر لهم جعلوا أصابعهم في آذانهم واستغشوا ثيابهم وأصروا واستكبروا استكبارا
en: "And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance.

source: ثم إني دعوتهم جهارا
en: "So I have called to them aloud;

source: ثم إني أعلنت لهم وأسررت لهم إسرارا
en: "Further I have spoken to them in public and secretly in private,

source: فقلت استغفروا ربكم إنه كان غفارا
en: "Saying, 'Ask forgiveness from your Lord; for He is Oft-Forgiving;

source: يرسل السماء عليكم مدرارا
en: "'He will send rain to you in abundance;

source: ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهارا
en: "'Give you increase in wealth and sons; and bestow on you gardens and bestow on you rivers (of flowing water).

source: ما لكم لا ترجون لله وقارا
en: "'What is the matter with you, that ye place not your hope for kindness and long-suffering in Allah,-

source: وقد خلقكم أطوارا
en: "'Seeing that it is He that has created you in diverse stages?

source: ألم تروا كيف خلق الله سبع سماوات طباقا
en: "'See ye not how Allah has created the seven heavens one above another,

source: وجعل القمر فيهن نورا وجعل الشمس سراجا
en: "'And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?

source: والله أنبتكم من الأرض نباتا
en: "'And Allah has produced you from the earth growing (gradually),

source: ثم يعيدكم فيها ويخرجكم إخراجا
en: "'And in the End He will return you into the (earth), and raise you forth (again at the Resurrection)?

source: والله جعل لكم الأرض بساطا
en: "'And Allah has made the earth for you as a carpet (spread out),

source: لتسلكوا منها سبلا فجاجا
en: "'That ye may go about therein, in spacious roads.'"

source: قال نوح رب إنهم عصوني واتبعوا من لم يزده ماله وولده إلا خسارا
en: Noah said: "O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss.

source: ومكروا مكرا كبارا
en: "And they have devised a tremendous Plot.

source: وقالوا لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا
en: "And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr';-

source: وقد أضلوا كثيرا ولا تزد الظالمين إلا ضلالا
en: "They have already misled many; and grant Thou no increase to the wrong-doers but in straying (from their mark)."

source: مما خطيئاتهم أغرقوا فأدخلوا نارا فلم يجدوا لهم من دون الله أنصارا
en: Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of Allah- none to help them.

source: وقال نوح رب لا تذر على الأرض من الكافرين ديارا
en: And Noah, said: "O my Lord! Leave not of the Unbelievers, a single one on earth!

source: إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا
en: "For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones.

source: رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تبارا
en: "O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!"

source: قل أوحي إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنا عجبا
en: Say: It has been revealed to me that a company of Jinns listened (to the Qur'an). They said, 'We have really heard a wonderful Recital!

source: يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا
en: 'It gives guidance to the Right, and we have believed therein: we shall not join (in worship) any (gods) with our Lord.

source: وأنه تعالى جد ربنا ما اتخذ صاحبة ولا ولدا
en: 'And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son.

source: وأنه كان يقول سفيهنا على الله شططا
en: 'There were some foolish ones among us, who used to utter extravagant lies against Allah;

source: وأنا ظننا أن لن تقول الإنس والجن على الله كذبا
en: 'But we do think that no man or spirit should say aught that untrue against Allah.

source: وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا
en: 'True, there were persons among mankind who took shelter with persons among the Jinns, but they increased them in folly.

source: وأنهم ظنوا كما ظننتم أن لن يبعث الله أحدا
en: 'And they (came to) think as ye thought, that Allah would not raise up any one (to Judgment).

source: وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا
en: 'And we pried into the secrets of heaven; but we found it filled with stern guards and flaming fires.

source: وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا
en: 'We used, indeed, to sit there in (hidden) stations, to (steal) a hearing; but any who listen now will find a flaming fire watching him in ambush.

source: وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا
en: 'And we understand not whether ill is intended to those on earth, or whether their Lord (really) intends to guide them to right conduct.

source: وأنا منا الصالحون ومنا دون ذلك كنا طرائق قددا
en: 'There are among us some that are righteous, and some the contrary: we follow divergent paths.

source: وأنا ظننا أن لن نعجز الله في الأرض ولن نعجزه هربا
en: 'But we think that we can by no means frustrate Allah throughout the earth, nor can we frustrate Him by flight.

source: وأنا لما سمعنا الهدى آمنا به فمن يؤمن بربه فلا يخاف بخسا ولا رهقا
en: 'And as for us, since we have listened to the Guidance, we have accepted it: and any who believes in his Lord has no fear, either of a short (account) or of any injustice.

source: وأنا منا المسلمون ومنا القاسطون فمن أسلم فأولئك تحروا رشدا
en: 'Amongst us are some that submit their wills (to Allah), and some that swerve from justice. Now those who submit their wills - they have sought out (the path) of right conduct:

source: وأما القاسطون فكانوا لجهنم حطبا
en: 'But those who swerve,- they are (but) fuel for Hell-fire'-

source: وأن لو استقاموا على الطريقة لأسقيناهم ماء غدقا
en: (And Allah's Message is): "If they (the Pagans) had (only) remained on the (right) Way, We should certainly have bestowed on them Rain in abundance.

source: لنفتنهم فيه ومن يعرض عن ذكر ربه يسلكه عذابا صعدا
en: "That We might try them by that (means). But if any turns away from the remembrance of his Lord, He will cause him to undergo a severe Penalty.

source: وأن المساجد لله فلا تدعوا مع الله أحدا
en: "And the places of worship are for Allah (alone): So invoke not any one along with Allah;

source: وأنه لما قام عبد الله يدعوه كادوا يكونون عليه لبدا
en: "Yet when the Devotee of Allah stands forth to invoke Him, they just make round him a dense crowd."

source: قل إنما أدعو ربي ولا أشرك به أحدا
en: Say: "I do no more than invoke my Lord, and I join not with Him any (false god)."

source: قل إني لا أملك لكم ضرا ولا رشدا
en: Say: "It is not in my power to cause you harm, or to bring you to right conduct."

source: قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا
en: Say: "No one can deliver me from Allah (If I were to disobey Him), nor should I find refuge except in Him,

source: إلا بلاغا من الله ورسالاته ومن يعص الله ورسوله فإن له نار جهنم خالدين فيها أبدا
en: "Unless I proclaim what I receive from Allah and His Messages: for any that disobey Allah and His Messenger,- for them is Hell: they shall dwell therein for ever."

source: حتى إذا رأوا ما يوعدون فسيعلمون من أضعف ناصرا وأقل عددا
en: At length, when they see (with their own eyes) that which they are promised,- then will they know who it is that is weakest in (his) helper and least important in point of numbers.

source: قل إن أدري أقريب ما توعدون أم يجعل له ربي أمدا
en: Say: "I know not whether the (Punishment) which ye are promised is near, or whether my Lord will appoint for it a distant term.

source: عالم الغيب فلا يظهر على غيبه أحدا
en: "He (alone) knows the Unseen, nor does He make any one acquainted with His Mysteries,-

source: إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا
en: "Except a messenger whom He has chosen: and then He makes a band of watchers march before him and behind him,
